# notification-processor - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/notification_processor_customer_v1_event]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/notification_processor_notification_v1_event_retry_0]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_notification_v1_event.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/notification_processor_notification_v1_event]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/notification_processor_customer_v1_event_retry_0]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Read complete after 0s [id=upstash_kafka_credential_secret_name]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_iam_role.lambda_role: Refreshing state... [id=le-notification_processor_notification_v1_event_retry_0]
module.common_resources.module.aws_lambda_notification_v1_event.aws_iam_role.lambda_role: Refreshing state... [id=le-notification_processor_notification_v1_event]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=2b72ed34-0e44-45a4-ba94-0e5251591de4:notification_processor]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role.lambda_role: Refreshing state... [id=le-notification_processor_customer_v1_event]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:064003852748:secret:upstash_kafka_credential_165306-NF4ZZ2]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role.lambda_role: Refreshing state... [id=le-notification_processor_customer_v1_event_retry_0]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_iam_role_policy_attachment.default: Refreshing state... [id=le-notification_processor_notification_v1_event_retry_0-20230527063716167900000004]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-6514be35-6c9d-45cc-bfd5-d4ff953b6cc3]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=3515066770]
module.common_resources.module.aws_lambda_notification_v1_event.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-notification_processor_notification_v1_event-20230527063716153300000003]
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=3515066770]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=3515066770]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=3515066770]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-notification_processor_customer_v1_event-20230527063716146700000002]
module.common_resources.module.aws_lambda_notification_v1_event.aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-notification_processor_notification_v1_event:lambda-secrets-policy-notification_processor_notification_v1_event]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-notification_processor_customer_v1_event:lambda-secrets-policy-notification_processor_customer_v1_event]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-notification_processor_notification_v1_event_retry_0:lambda-secrets-policy-notification_processor_notification_v1_event_retry_0]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy_attachment.default: Refreshing state... [id=le-notification_processor_customer_v1_event_retry_0-20230527063716116000000001]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-notification_processor_customer_v1_event_retry_0:lambda-secrets-policy-notification_processor_customer_v1_event_retry_0]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-71cc196e-357d-414a-ac72-a27674097bd5]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Read complete after 3s [id=721a68ea8f6ed1c81be6d50607b968e324bf082d]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_lambda_function.default: Refreshing state... [id=notification_processor_customer_v1_event_retry_0]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.archive_file.default: Read complete after 3s [id=3c299db82dc4e95ee7ead8beed810bfb58c2c53d]
module.common_resources.module.aws_lambda_notification_v1_event.data.archive_file.default: Read complete after 3s [id=3c299db82dc4e95ee7ead8beed810bfb58c2c53d]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_lambda_function.default: Refreshing state... [id=notification_processor_notification_v1_event_retry_0]
module.common_resources.module.aws_lambda_notification_v1_event.aws_lambda_function.default: Refreshing state... [id=notification_processor_notification_v1_event]
module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Read complete after 3s [id=721a68ea8f6ed1c81be6d50607b968e324bf082d]
module.common_resources.module.aws_lambda_customer_v1_event.aws_lambda_function.default: Refreshing state... [id=notification_processor_customer_v1_event]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_notification_v1_event_retry_topics[0]: Refreshing state... [id=52233490-d70a-4601-9c66-3906039f7584]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_retry_topics[0]: Refreshing state... [id=7d38dce3-bd9b-45ed-9f6a-c9e1fbf1de6c]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_notification_v1_event_topic: Refreshing state... [id=e54ba27d-7aa3-4f4f-958c-dcb018cd32ad]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_topic: Refreshing state... [id=a5f7cec8-0851-4614-bacd-11620e4d30e1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda_customer_v1_event.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "notification_processor_customer_v1_event"
        tags                           = {
            "domain"        = "notification"
            "environment"   = "production"
            "resource"      = "notification-processor"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "sharing-tortoise-8552-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "dcb14a7f24bc4f7992bbe541919e020c"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "c2hhcmluZy10b3J0b2lzZS04NTUyJHVJ3ozhIEgLwBeQ1A2M5r7T00NFZXw8uXo"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "notification_processor_customer_v1_event_retry_0"
        tags                           = {
            "domain"        = "notification"
            "environment"   = "production"
            "resource"      = "notification-processor"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "sharing-tortoise-8552-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "dcb14a7f24bc4f7992bbe541919e020c"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "c2hhcmluZy10b3J0b2lzZS04NTUyJHVJ3ozhIEgLwBeQ1A2M5r7T00NFZXw8uXo"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_notification_v1_event.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "notification_processor_notification_v1_event"
        tags                           = {
            "domain"        = "notification"
            "environment"   = "production"
            "resource"      = "notification-processor"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "sharing-tortoise-8552-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "dcb14a7f24bc4f7992bbe541919e020c"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "c2hhcmluZy10b3J0b2lzZS04NTUyJHVJ3ozhIEgLwBeQ1A2M5r7T00NFZXw8uXo"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "notification_processor_notification_v1_event_retry_0"
        tags                           = {
            "domain"        = "notification"
            "environment"   = "production"
            "resource"      = "notification-processor"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "sharing-tortoise-8552-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "dcb14a7f24bc4f7992bbe541919e020c"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "c2hhcmluZy10b3J0b2lzZS04NTUyJHVJ3ozhIEgLwBeQ1A2M5r7T00NFZXw8uXo"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "notification"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "notification_processor"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "2b72ed34-0e44-45a4-ba94-0e5251591de4:notification_processor"
        name       = "notification_processor"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "1443d708-4baf-4076-99f2-bca2ae43e1d7" -> "325c7000-e9e9-4cfa-8212-aee30b49a332"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*